[

    {
      "title": "Human anatomy introduction",
      "text": "Human anatomy is the branch of science that studies the structure of the human body. The word anatomy comes from the Greek term anatome, which means cutting up. In Latin, the equivalent term is dissection. While dissection refers specifically to the technique of cutting and examining body structures, anatomy covers a much broader field of study. Anatomy provides the foundational knowledge for all of medicine and is essential for understanding much of medical terminology. As one analogy puts it, Anatomy is to physiology what geography is to history , in other words, anatomy describes the physical setting where all the functions of the body take place."
    },
    {
      "title": "Subdivisions of Anatomy",
      "text": "Anatomy was traditionally studied through dissection, but with advancements in modern techniques, the scope of anatomical study has greatly expanded. Today, anatomy encompasses various methods that help us explore and understand the structure of the human body more comprehensively. The main subdivisions of anatomy are as follows:\n1. Cadaveric Anatomy: This involves studying preserved (embalmed) bodies, typically with the naked eye. It can be approached in two ways:\n\n   * Regional Anatomy: The body is studied in specific regions, such as the upper limb, lower limb, thorax, abdomen, head and neck, and brain.\n\n   * Systemic Anatomy: The body is studied by systems, like the skeletal system (osteology), muscular system (myology), joints (arthrology), vascular system (angiology), nervous system (neurology), and other organ systems like respiratory, digestive, urogenital, and endocrine (splanchnology).\n\n      2. Living Anatomy: This is the study of the body in a living person using techniques like inspection, palpation, percussion, auscultation, endoscopy (e.g., bronchoscopy, gastroscopy), radiography, and electromyography.\n\n      3. Embryology (Developmental Anatomy): The study of the prenatal development of an individual. This includes understanding the changes that occur during early development, known as ontogeny, as well as the evolutionary history of species, called phylogeny.\n\n      4. Histology (Microscopic Anatomy): This involves studying the body’s structures at a microscopic level using a microscope to examine tissues and cells.\n\n      5. Surface Anatomy (Topographic Anatomy): This focuses on understanding the relationship between deeper body structures and the skin's surface. It’s particularly useful in clinical practice, especially during surgeries.\n\n      6. Radiographic and Imaging Anatomy: This involves studying bones and internal organs using imaging techniques like X-rays, ultrasounds, and CT scans, often enhanced with contrast media.\n\n      7. Comparative Anatomy: The study of the anatomical structures of other animals to better understand the evolutionary changes in the human body’s form, structure, and function (morphology).\n\n      8. Physical Anthropology: This examines the external features and measurements of different human populations and studies prehistoric human remains.\n\n      9. Applied Anatomy (Clinical Anatomy): This focuses on applying anatomical knowledge in clinical and surgical settings to improve diagnosis and treatment.\n\n      10. Experimental Anatomy: This is the study of the factors that influence and determine the structure and function of the body’s parts through experimentation.\n\n      11. Genetics: This branch deals with the study of genetic information stored in chromosomes and how it influences an individual’s anatomy and development.\nHistory of Anatomy"
    },
    {
      "title": "History of Anatomy",
      "text": "The study of human anatomy has evolved over centuries, shaped by cultural, religious, and scientific developments. Here's a brief overview of its progress through different historical periods:\n         1. Greek Period (Before Christ)\n Early Greek scholars like Hippocrates and Aristotle laid the foundations of anatomical knowledge. Aristotle is often considered the \"Father of Biology.\" Herophilus and Erasistratus were among the first to perform systematic dissections on human bodies in Alexandria, contributing significantly to early anatomical understanding.\n\n         2. Roman Period (After Christ)\n Galen, a prominent Roman physician, compiled extensive anatomical knowledge based mainly on animal dissections. His teachings dominated medical science for over a thousand years, despite many inaccuracies due to the lack of human dissection.\n\n         3. Fourteenth Century\n The study of anatomy was revived in medieval Europe. Dissection of human cadavers was reintroduced in medical schools, particularly in Italy. Mondino de Luzzi is known for writing one of the first anatomical texts based on human dissection.\n\n         4. Fifteenth Century\n The Renaissance sparked renewed interest in direct observation and accurate anatomical drawings. Leonardo da Vinci produced highly detailed anatomical sketches based on his own dissections, blending art and science.\n\n         5. Sixteenth Century\n This era marked a turning point in anatomy. Andreas Vesalius, a Flemish anatomist, published De humani corporis fabrica (1543), correcting many of Galen’s errors and emphasizing direct human dissection.\n\n         6. Seventeenth Century\n The invention of the microscope opened a new world of microscopic anatomy. Marcello Malpighi is considered the founder of histology and was the first to observe capillaries, linking arteries and veins.\n\n         7. Eighteenth Century\n Anatomy continued to grow as a scientific discipline. Detailed anatomical atlases were produced, and medical education became more structured. There was a focus on comparative anatomy and understanding the body’s systems more clearly.\n\n         8. Nineteenth Century\n Major advancements occurred in surgical anatomy, pathology, and embryology. Dissection became a standard part of medical education. The use of formalin for preservation improved cadaveric studies.\n\n         9. Twentieth Century\n Imaging technologies revolutionized anatomical study. X-rays, CT scans, MRIs, and ultrasounds allowed visualization of internal structures in living patients. Cross-sectional anatomy and clinical anatomy became central to medical training.\n\n         10. Twenty-First Century\n Modern anatomy integrates advanced imaging, 3D modeling, virtual dissection tables, and digital simulations. Genetics, molecular biology, and computer-assisted learning have expanded the scope of anatomical research and education."
    },
    {
      "title": "Anatomical Nomenclature",
      "text": "Anatomical nomenclature refers to the standardized language used to describe the structures of the human body. This system ensures that healthcare professionals around the world can communicate clearly and accurately. The most widely accepted system today is the Terminologia Anatomica, which provides consistent Latin and English terms for anatomical structures."
    },
    {
      "title": "Language of Anatomy",
      "text": "\n2. Language of Anatomy\nTo describe the location and orientation of structures in the body, anatomy uses a set of standardized terms based on an agreed reference position and specific planes and directions. This section introduces key concepts and terms.\n\n\na. Positions\nUnderstanding body positions is essential for accurate anatomical description.\n            * Anatomical Position:\nThe body stands upright, facing forward, with arms at the sides and palms facing forward. Feet are flat on the ground and slightly apart. This position is the reference point for all anatomical terms.\n\n            * Supine Position:\nThe body lies flat on the back, face upward.\n\n            * Prone Position:\nThe body lies flat on the abdomen, face downward.\n\n            * Lithotomy Position:\nThe patient lies on their back with hips and knees flexed, thighs apart, and feet in stirrups , commonly used in gynecological and urological procedures.\n\n\n\nb. Planes\nThe body is divided into sections by imaginary planes:\n               * Median (Midsagittal) Plane: Divides the body into equal right and left halves.\n\n               * Sagittal Plane: Any vertical plane parallel to the median plane, dividing the body into right and left portions (not necessarily equal).\n\n               * Coronal (Frontal) Plane: Divides the body into front (anterior) and back (posterior) parts.\n\n               * Transverse (Horizontal) Plane: Divides the body into upper (superior) and lower (inferior) parts.\n\n               * Oblique Plane: A diagonal cut that does not follow the standard planes.\n\n\n\nc. Terms Used in Relation to the Trunk\n                  * Anterior (Ventral): Toward the front of the body\n\n                  * Posterior (Dorsal): Toward the back\n\n                  * Superior (Cranial): Toward the head or upper part\n\n                  * Inferior (Caudal): Toward the feet or lower part\n\n                  * Medial: Closer to the midline\n\n                  * Lateral: Farther from the midline\n\n                  * Proximal: Closer to the origin or point of attachment\n\n                  * Distal: Farther from the origin or point of attachment\n\n                  * Superficial: Near the surface\n\n                  * Deep: Further from the surface\n\n\n\nd. Terms Used in Relation to the Upper Limb\n                     * Palmar: Refers to the palm side of the hand\n\n                     * Dorsal (of hand): Refers to the back of the hand\n\n                     * Radial: Toward the radius (lateral side/thumb side)\n\n                     * Ulnar: Toward the ulna (medial side/little finger side)\n\n\n\ne. Terms Used in Relation to the Lower Limb\n                        * Plantar: Refers to the sole of the foot\n\n                        * Dorsal (of foot): Refers to the top of the foot\n\n                        * Tibial: Toward the tibia (medial side/big toe side)\n\n                        * Fibular (Peroneal): Toward the fibula (lateral side/little toe side)\n\nHere’s a clear and concise rewrite of Terms Related to Body Movements:"
    },
    {
      "title": "Terms Related to Body Movements",
      "text": "Movements at synovial joints can be categorized into four main types based on how the bones interact:\n    \n1. Gliding Movement\nThis occurs when relatively flat surfaces of bones move back and forth or side to side against each other. The angle between the bones does not change significantly. An example is the movement between the bones of the wrist or ankle.\n\n\n2. Angular Movements\nThese movements change the angle between articulating bones:\n                           * Flexion: The angle between the bones decreases (e.g., bending the elbow or knee).\n\n                           * Extension: The angle between the bones increases (e.g., straightening the elbow or knee).\n\n                           * Lateral Flexion: Movement of the trunk sideways (e.g., bending the torso to the left or right).\n\n                           * Abduction: Movement of a limb away from the body’s midline (e.g., raising the arm to the side).\n\n                           * Adduction: Movement of a limb toward the body’s midline (e.g., bringing the arm back down to the side).\n\n3. Rotation\nThis involves a bone rotating around its own axis:\n                              * Medial Rotation: The front surface of a limb bone turns toward the body’s midline (e.g., rotating the arm inward).\n\n                              * Lateral Rotation: The front surface of a limb bone turns away from the midline (e.g., rotating the arm outward).\n\n4. Special Movements\nThese movements occur at specific joints:\n                                 * Pronation and Supination: At the radioulnar joint of the forearm, supination is when the palm faces upward or forward (e.g., holding a bowl of soup), and pronation is when the palm faces downward or backward (e.g., turning the palm to push something away).\n\n                                 * Protraction and Retraction: These occur at the temporomandibular joint (jaw). Protraction moves the jaw forward, and retraction moves it backward.\n\n\n\nIn the Upper Limb:\n                                    * Flexion: Bringing two flexor surfaces closer together (e.g., bending the elbow).\n\n                                    * Extension: Straightening the arm (e.g., extending the elbow).\n\n                                    * Abduction: Moving the limb away from the body (e.g., raising the arm).\n\n                                    * Adduction: Bringing the limb back toward the body (e.g., lowering the arm).\n\n                                    * Circumduction: A circular movement of the distal part of a limb (e.g., making circles with the arm).\n\n                                    * Medial Rotation: Rotating the arm inward, bringing the flexed forearm across the chest.\n\n                                    * Lateral Rotation: Rotating the arm outward, moving the flexed forearm away from the body.\n\n                                    * Supination: Turning the palm upwards or forwards (e.g., holding food in your palm).\n\n                                    * Pronation: Turning the palm downwards or backwards (e.g., reaching for something).\n\n                                    * Adduction of Digits: Bringing fingers together.\n\n                                    * Abduction of Digits: Spreading fingers apart.\n\n                                    * Opposition of Thumb: When the tip of the thumb touches the tips of the other fingers.\n\n                                    * Circumduction of Thumb: A circular motion of the thumb combining flexion, extension, abduction, and adduction.\n\nIn the Lower Limb:\n                                       * Flexion of Thigh: When the front of the thigh moves toward the abdomen (e.g., lifting the leg).\n\n                                       * Extension of Thigh: When the thigh moves back to a straight line, as in standing.\n\n                                       * Abduction of Thigh: Moving the thigh away from the midline of the body.\n\n                                       * Adduction of Thigh: Bringing the thigh toward the midline.\n\n                                       * Medial Rotation of Thigh: Rotating the thigh inward.\n\n                                       * Lateral Rotation of Thigh: Rotating the thigh outward.\n\n                                       * Flexion of Knee: When the back of the thigh and leg come together (e.g., bending the knee).\n\n                                       * Extension of Knee: When the thigh and leg are straightened (e.g., standing up).\n\n                                       * Dorsiflexion of Foot: When the top of the foot moves closer to the shin, and the sole faces forward.\n\n                                       * Plantarflexion of Foot: When the sole of the foot moves downward (e.g., standing on tiptoe).\n\n                                       * Inversion of Foot: When the inner edge of the foot is raised.\n\n                                       * Eversion of Foot: When the outer edge of the foot is raised.\n\n\n\nIn the Neck\n                                          * Flexion: The movement of the head forward, bringing the face closer to the chest (e.g., nodding down).\n\n                                          * Extension: The movement of the head backward, bringing the face away from the chest (e.g., looking up).\n\n                                          * Lateral Flexion: Tilting the head sideways, bringing the ear closer to the shoulder (e.g., ear to shoulder).\n\n                                          * Rotation: Turning the neck so that the chin moves toward the opposite side (e.g., turning the head left or right).\n\n                                          * Opening the Mouth: Lowering the lower jaw to open the mouth (e.g., yawning or speaking).\n\n                                          * Closure of the Mouth: Bringing the lower jaw up to meet the upper jaw, closing the mouth.\n\n                                          * Protraction: Sliding the lower jaw forward in its socket within the temporal bone of the skull.\n\n                                          * Retraction: Sliding the lower jaw backward in its socket within the temporal bone of the skull."
    },
    {
      "title": "Terms Used for Describing Muscles",
      "text": "* Origin: The fixed, relatively immobile end of a muscle during contraction (e.g., the attachment of the biceps to the scapula).\n\n                                                * Insertion: The movable end of the muscle, where contraction causes movement (e.g., the attachment of the biceps to the radius).\n\n                                                   * Note: In some cases, the origin and insertion may be interchangeable if the muscle's position changes during movement.\n\n                                                      * Belly: The central, fleshy, and contractile part of the muscle where contraction occurs.\n\n                                                      * Tendon: The non-contractile, fibrous, cord-like structure that connects a muscle to a bone.\n\n                                                      * Aponeurosis: A broad, flat tendon that connects muscle to bone or to other muscles.\n\n                                                      * Raphe: A fibrous band formed by interwoven fibers of tendons or aponeuroses. Unlike ligaments, raphe structures are stretchable."
    },
    {
      "title": "Terms Used for Describing Vessels",
      "text": "* Arteries: Vessels that carry oxygenated blood away from the heart (except for pulmonary and umbilical arteries, which carry deoxygenated blood). Arteries branch out like trees, with smaller branches called arterioles.\n\n                                                         * Veins: Vessels that carry deoxygenated blood toward the heart (except for pulmonary and umbilical veins, which carry oxygenated blood). Veins resemble rivers, with smaller tributaries called venules. Veins contain valves that ensure unidirectional blood flow.\n\n                                                         * Capillaries: Microscopic vessels that form a network connecting arterioles to venules. They are the site of nutrient and gas exchange.\n\n                                                         * Anastomosis: A connection between two blood vessels, either before or after the capillary network, allowing for alternative routes of blood flow."
    },
    {
      "title": "Terms Used for Describing Bone Features",
      "text": "* Elevations: Raised or protruding areas on a bone, which can take different forms:\n\n                                                               * Linear Elevation: A line, ridge, lip, or crest along the surface.\n\n                                                               * Sharp Elevation: A pointed projection such as a spine, styloid process, cornu (horn), or hamulus.\n\n                                                               * Rounded/Irregular Elevation: A tubercle, tuberosity, epicondyle, malleolus, or trochanter. A ramus refers to a broad arm or process extending from the main body of a bone.\n\n                                                                  * Depressions: Indentations or hollowed areas in a bone, which may include a pit, fovea, fossa, groove (or sulcus), or notch (incisura).\n\n                                                                  * Openings: Holes or passages in bones such as a foramen, canal, hiatus, or aqueduct.\n\n                                                                  * Cavities: Large hollow spaces within a bone are called sinus, cell, or antrum.\n\n                                                                  * Smooth Articular Areas: Flat, smooth surfaces that form joints, s"
    },
    {
      "title": "Terms Related to Medical Conditions and Procedures",
      "text": "1. -itis: A suffix meaning inflammation (e.g., appendicitis, tonsillitis, arthritis).\n\n                                                                     2. -ectomy: A suffix meaning removal of a part from the body (e.g., appendicectomy, tonsillectomy, gastrectomy).\n\n                                                                     3. -otomy: A suffix meaning to open and then close a hollow organ (e.g., laparotomy, hysterotomy, cystotomy).\n\n                                                                     4. -ostomy: A suffix meaning to open a hollow organ and leave it open (e.g., cystostomy, colostomy, tracheostomy).\n\n                                                                     5. -oma: A suffix meaning a tumor or swelling (e.g., lipoma, osteoma, neurofibroma).\n\n\n\nTerms Related to Development and Growth\n                                                                        6. Puberty: The age at which secondary sexual characteristics develop. It occurs between 12-15 years in girls and 13-16 years in boys.\n\n\n\nTerms for Describing Medical Symptoms and Signs\n                                                                           7. Symptoms: Subjective complaints reported by the patient about their condition (e.g., pain, dizziness).\n\n                                                                           8. Signs: Objective findings observed by the doctor during an examination (e.g., fever, rash).\n\n                                                                           9. Diagnosis: The identification of a disease or condition.\n\n                                                                           10. Prognosis: The predicted course or outcome of a disease.\n\n                                                                           11. Pyrexia: The medical term for fever.\n\n                                                                           12. Lesion: Any abnormal change or injury in tissue.\n\n                                                                           13. Inflammation: A local tissue reaction to injury or abnormal stimuli, characterized by:\n\n                                                                              * Swelling\n\n                                                                              * Pain\n\n                                                                              * Redness\n\n                                                                              * Heat\n\n                                                                              * Loss of function\n\n                                                                                 14. Oedema: Swelling caused by fluid accumulation in the tissues.\n\n                                                                                 15. Thrombosis: The formation of a blood clot within a blood vessel.\n\n                                                                                 16. Embolism: The blockage of a vessel by a clot or other particle that has traveled through the bloodstream.\n\n                                                                                 17. Haemorrhage: Bleeding, either external or internal.\n\n                                                                                 18. Ulcer: A localized break in the surface of the skin or mucous membrane.\n\n                                                                                 19. Sinus: A closed track lined by epithelial tissue, usually open at one end.\n\n                                                                                 20. Fistula: A passage or track that is open at both ends and lined by epithelial tissue.\n\n                                                                                 21. Necrosis: The death of cells or tissues due to irreversible damage.\n\n                                                                                 22. Degeneration: A reversible decline in the structure and function of tissue, which may eventually lead to necrosis.\n\n                                                                                 23. Gangrene: A form of necrosis involving the decay of tissues due to bacterial infection.\n\n                                                                                 24. Infarction: Tissue death (necrosis) caused by a blockage in its blood supply.\n\n                                                                                 25. Atrophy: The decrease in size of cells, tissues, or organs due to reduced nourishment or activity.\n\n                                                                                 26. Dystrophy: The decrease in size of tissues or organs due to defective nourishment or growth.\n\n                                                                                 27. Hypertrophy: The increase in the size of a tissue or organ due to an increase in the size of its cells.\n\n                                                                                 28. Hyperplasia: The increase in the size of a tissue or organ due to an increase in the number of its cells.\n\n                                                                                 29. Hypoplasia: Underdevelopment or incomplete development of a tissue or organ.\n\n                                                                                 30. Aplasia: The failure of development of a tissue or organ.\n\n\n\nTerms for Describing Conditions and Disorders\n                                                                                    31. Syndrome: A group of symptoms and signs that together define a particular disease or condition.\n\n                                                                                    32. Paralysis: The loss of the ability to move part of the body due to nerve damage or muscle disease.\n\n                                                                                    33. Hemiplegia: Paralysis affecting one side of the body.\n\n                                                                                    34. Paraplegia: Paralysis of both legs and possibly part of the lower trunk.\n\n                                                                                    35. Monoplegia: Paralysis of one limb.\n\n                                                                                    36. Quadriplegia: Paralysis of all four limbs.\n\n                                                                                    37. Anaesthesia: The loss of the sense of touch.\n\n                                                                                    38. Analgesia: The loss of the sense of pain.\n\n                                                                                    39. Thermanaesthesia: The loss of the sense of temperature.\n\n                                                                                    40. Hyperaesthesia: Abnormally heightened sensitivity to stimuli.\n\n                                                                                    41. Paraesthesia: Abnormal sensations like tingling or “pins and needles.”\n\n                                                                                    42. Coma: A state of deep unconsciousness with no response to stimuli.\n\n\n\nTerms for Tumors and Cancer\n                                                                                       43. Tumor (Neoplasm): An abnormal, non-inflammatory growth of tissue.\n\n                                                                                       44. Benign: A mild growth or illness that does not threaten life.\n\n                                                                                       45. Malignant: A severe, resistant growth that is likely to spread and may result in death.\n\n                                                                                       46. Carcinoma: A type of malignant tumor originating from epithelial tissue.\n\n                                                                                       47. Sarcoma: A malignant tumor originating from connective tissue.\n\n                                                                                       48. Cancer: A general term for any malignant tumor that invades tissues and causes death.\n\n                                                                                       49. Metastasis: The spread of cancer cells or disease from one part of the body to another.\n\n                                                                                       50. Convalescence: The period of recovery following illness or disease.\n\n                                                                                       51. Therapy: Treatment used to manage or cure a medical condition.\nArrangement of Structures in the Body: From Within Outwards"
    },
    {
      "title": "Arrangement of Structures in the Body: From Within Outwards",
      "text": "Bones: Serve as the body's rigid framework, providing structure, support, and protection for vital organs.\n\n                                                                                          2. Muscles: Attach to bones and allow movement by contracting and relaxing. They are essential for posture and locomotion.\n\n                                                                                          3. Blood Vessels, Nerves, and Lymphatics: These form the neurovascular bundles, which are networks that run between muscles and along the fascial planes, ensuring the delivery of nutrients, oxygen, and signaling throughout the body.\n\n                                                                                          4. Viscera: Internal organs like the heart, lungs, liver, kidneys, and intestines, which are housed in the thoracic and abdominal cavities, playing key roles in circulation, digestion, respiration, and other vital functions.\n\n                                                                                          5. General Coverings: The body is enveloped in three layers:\n\n                                                                                             * Skin: The outermost layer, acting as a protective barrier against external elements.\n\n                                                                                             * Superficial Fascia: A layer of connective tissue just beneath the skin, housing fat and other structures like blood vessels and nerves.\n\n                                                                                             * Deep Fascia: A dense connective tissue that surrounds muscles and organs, providing structural support and compartmentalization."
    },
    {
      "title": "Summary",
      "text": "Anatomy, at its core, is the study of the body's structure and organization, and understanding the arrangement of these structures is essential for both clinical practice and education. The body is a highly organized system, with each layer serving a specific function to ensure overall efficiency and health. At the deepest level, bones form the sturdy scaffolding, protecting the brain, spinal cord, and other critical organs. Surrounding this rigid framework, muscles enable movement, both voluntary and involuntary, through their connection to bones and their interaction with other tissues. Vascular, neural, and lymphatic networks are interwoven with muscles, ensuring vital functions like circulation, sensation, and immune defense. Organs, or viscera, lie within body cavities, each adapted for specialized tasks, from digestion to circulation. Covering all these structures is a series of protective layers,the skin, superficial fascia, and deep fascia. These not only shield the body from external threats but also support internal stability. This hierarchy of organization, from bones to fascia, highlights the complexity and harmony of the human body, and why a clear understanding of these layers is fundamental to grasping anatomy and its applications in medicine."
    }
  
]